# synth_new_alu.ys
read_verilog -sv new_alu.sv
copy new_alu synth_new_alu
hierarchy -top synth_new_alu
synth
abc -g AND,OR,XOR,NAND,NOR
opt_clean
write_verilog -noattr synth_new_alu.sv
stat -tech cmos
