# Wczytanie pliku modelu
    read_verilog -sv UART.sv

# Utworzenie kopi modulu z inna nazwa
    copy UART UART_synth

# Ustawienie hierarchii projektu na nowy modul 
    hierarchy -top UART_synth

# Synteza logiczna
    synth

# Mapowanie na bramki
    abc -g AND,OR,XOR

# Optymalizacja po mapowaniu
    opt_clean

# Zapis wyniku symulacji
    write_verilog -noattr UART_synth.sv
    
# Wypisanie statystyki uzytych bramek
    stat -tech cmos
